content/mysql/mysql-manual.org
# -*- coding:utf-8 -*-
#+TITLE:MYSQL Reference Manual
#+author: 刘尚亮
#+email：phenix3443@gmail.com
#+STARTUP: overview

* 简介
  基于[[https://dev.mysql.com/doc/refman/5.7/en/][MySQL 5.7 Reference Manual]]以及日常使用整理的最佳实践。排列按照手册章节进行排列。

* Preface and Legal Notices
* General Information
* Installing and Upgrading MySQL
* Using MySQL as a Document Store
* Tutorial
* MySQL Programs
** Overview of MySQL Programs
** Using MySQL Programs
*** Invoking MySQL Programs
*** Connecting to the MySQL Server
*** Specifying Program Options
*** Using Options on the Command Line
*** Program Option Modifiers
*** Using Option Files
*** Command-Line Options that Affect Option-File Handling
*** Using Options to Set Program Variables
*** Option Defaults, Options Expecting Values, and the = Sign
*** Setting Environment Variables
** MySQL Server and Server-Startup Programs
** MySQL Installation-Related Programs
** MySQL Client Programs
*** mysql — The MySQL Command-Line Tool
**** mysql Options
**** mysql Commands
**** mysql Logging
**** mysql Server-Side Help
**** Executing SQL Statements from a Text File
**** mysql Tips
*** mysqladmin — Client for Administering a MySQL Server
*** mysqlcheck — A Table Maintenance Program
*** mysqldump — A Database Backup Program
