docs/mysql/mysql-manual.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-26 日 10:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MYSQL Reference Manual</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="刘尚亮" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">MYSQL Reference Manual</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2d76d0c">1. 简介</a></li>
<li><a href="#org14d0e18">2. Preface and Legal Notices</a></li>
<li><a href="#orgbf83808">3. General Information</a></li>
<li><a href="#org831dd58">4. Installing and Upgrading MySQL</a></li>
<li><a href="#org4c80e07">5. Using MySQL as a Document Store</a></li>
<li><a href="#orgb848aa9">6. Tutorial</a></li>
<li><a href="#orgf6b088f">7. MySQL Programs</a>
<ul>
<li><a href="#orgd11641e">7.1. Overview of MySQL Programs</a></li>
<li><a href="#orgacc67fa">7.2. Using MySQL Programs</a>
<ul>
<li><a href="#org76790ee">7.2.1. Invoking MySQL Programs</a></li>
<li><a href="#org160e83e">7.2.2. Connecting to the MySQL Server</a></li>
<li><a href="#org1df0b05">7.2.3. Specifying Program Options</a></li>
<li><a href="#orgc0e9b63">7.2.4. Using Options on the Command Line</a></li>
<li><a href="#orgafdb448">7.2.5. Program Option Modifiers</a></li>
<li><a href="#org17a748b">7.2.6. Using Option Files</a></li>
<li><a href="#org4e3818b">7.2.7. Command-Line Options that Affect Option-File Handling</a></li>
<li><a href="#orge7bf750">7.2.8. Using Options to Set Program Variables</a></li>
<li><a href="#orgb60cae4">7.2.9. Option Defaults, Options Expecting Values, and the = Sign</a></li>
<li><a href="#org25cc85e">7.2.10. Setting Environment Variables</a></li>
</ul>
</li>
<li><a href="#org5507cfb">7.3. MySQL Server and Server-Startup Programs</a></li>
<li><a href="#org3633dd6">7.4. MySQL Installation-Related Programs</a></li>
<li><a href="#org9b03127">7.5. MySQL Client Programs</a>
<ul>
<li><a href="#org79e125c">7.5.1. mysql — The MySQL Command-Line Tool</a>
<ul>
<li><a href="#org20b7323">7.5.1.1. mysql Options</a></li>
<li><a href="#org829123d">7.5.1.2. mysql Commands</a></li>
<li><a href="#org02533d8">7.5.1.3. mysql Logging</a></li>
<li><a href="#org87397ca">7.5.1.4. mysql Server-Side Help</a></li>
<li><a href="#orgdb71c1e">7.5.1.5. Executing SQL Statements from a Text File</a></li>
<li><a href="#orga1c48b8">7.5.1.6. mysql Tips</a></li>
</ul>
</li>
<li><a href="#org5ec5946">7.5.2. mysqladmin — Client for Administering a MySQL Server</a></li>
<li><a href="#org0a657ca">7.5.3. mysqlcheck — A Table Maintenance Program</a></li>
<li><a href="#org65ad3f4">7.5.4. mysqldump — A Database Backup Program</a></li>
<li><a href="#orgef82c5e">7.5.5. mysqlimport — A Data Import Program</a></li>
<li><a href="#org3280b2e">7.5.6. mysqlpump — A Database Backup Program</a></li>
<li><a href="#orgbd1ca63">7.5.7. mysqlshow — Display Database, Table, and Column Information</a></li>
<li><a href="#orga485fad">7.5.8. mysqlslap — Load Emulation Client</a></li>
</ul>
</li>
<li><a href="#org868bff2">7.6. MySQL Administrative and Utility Programs</a></li>
<li><a href="#org80206a9">7.7. MySQL Program Development Utilities</a></li>
<li><a href="#org9f7b51e">7.8. Miscellaneous Programs</a></li>
</ul>
</li>
<li><a href="#org996c546">8. MySQL Server Administration</a>
<ul>
<li><a href="#org580d1cb">8.1. The MySQL Server</a>
<ul>
<li><a href="#org9eff953">8.1.1. Server Option and Variable Reference</a></li>
<li><a href="#org8c95282">8.1.2. Server Configuration Defaults</a></li>
<li><a href="#org815d627">8.1.3. Server Command Options</a></li>
<li><a href="#orgf000c7f">8.1.4. Server System Variables</a></li>
<li><a href="#orgfe701a0">8.1.5. Using System Variables</a></li>
<li><a href="#orgd552cfe">8.1.6. Server Status Variables</a></li>
<li><a href="#org796178d">8.1.7. Server SQL Modes</a></li>
<li><a href="#orgf9dec9a">8.1.8. Server Plugins</a></li>
<li><a href="#org2f3255b">8.1.9. IPv6 Support</a></li>
<li><a href="#org1aa2721">8.1.10. Server-Side Help</a></li>
<li><a href="#org20cd4dd">8.1.11. Server Response to Signals</a></li>
<li><a href="#org6c5a7d7">8.1.12. The Server Shutdown Process</a></li>
</ul>
</li>
<li><a href="#orgacdc419">8.2. The MySQL Data Directory</a></li>
<li><a href="#org76d9956">8.3. The mysql System Database</a></li>
<li><a href="#orgaeba899">8.4. MySQL Server Logs</a></li>
<li><a href="#org18f411f">8.5. Running Multiple MySQL Instances on One Machine</a></li>
<li><a href="#org02e7614">8.6. Tracing mysqld Using DTrace</a></li>
</ul>
</li>
<li><a href="#orgfcc0411">9. Security</a></li>
<li><a href="#orgb9c389c">10. Backup and Recovery</a></li>
<li><a href="#orgf2931e8">11. Optimization</a></li>
<li><a href="#org43e2ba5">12. Language Structure</a></li>
<li><a href="#org798c840">13. Globalization</a></li>
<li><a href="#org5b785f2">14. Data Types</a></li>
<li><a href="#org140883f">15. Functions and Operators</a>
<ul>
<li><a href="#org6341f25">15.1. 13.5 String Functions</a>
<ul>
<li><a href="#org5c18731">15.1.1. 13.5.2 Regular Expressions</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb787f03">16. SQL Statement Syntax</a></li>
<li><a href="#orgeae09a3">17. The InnoDB Storage Engine</a></li>
<li><a href="#org035296d">18. Alternative Storage Engines</a></li>
<li><a href="#org87208fc">19. High Availability and Scalability</a></li>
<li><a href="#orgc980611">20. Replication</a></li>
<li><a href="#orgf0d6084">21. MySQL Cluster NDB 7.5</a></li>
<li><a href="#orgdd371a7">22. Partitioning</a></li>
<li><a href="#orgb2cbd0a">23. Stored Programs and Views</a></li>
<li><a href="#org9a0143a">24. INFORMATION_SCHEMA Tables</a></li>
<li><a href="#orgedb14d2">25. MySQL Performance Schema</a></li>
<li><a href="#org63d3e1c">26. MySQL sys Schema</a></li>
<li><a href="#org6e5422a">27. Connectors and APIs</a></li>
<li><a href="#org63fbd71">28. Extending MySQL</a></li>
<li><a href="#org302b43d">29. MySQL Enterprise Edition</a></li>
<li><a href="#orgba3e75d">30. MySQL Workbench</a></li>
<li><a href="#org04dd98d">31. MySQL 5.7 Frequently Asked Questions</a></li>
<li><a href="#org9108c08">32. Errors, Error Codes, and Common Problems</a>
<ul>
<li><a href="#orgd4268db">32.1. Sources of Error Information</a></li>
<li><a href="#org8b4f80c">32.2. Types of Error Values</a></li>
<li><a href="#org7e41f6f">32.3. Server Error Codes and Messages</a></li>
<li><a href="#orgda92d98">32.4. Client Error Codes and Messages</a></li>
<li><a href="#org53ccf4b">32.5. Problems and Common Errors</a>
<ul>
<li><a href="#org81ef973">32.5.1. How to Determine What Is Causing a Problem</a></li>
<li><a href="#org0eaccc3">32.5.2. Common Errors When Using MySQL Programs</a></li>
<li><a href="#orgc435381">32.5.3. Administration-Related Issues</a></li>
<li><a href="#org4eb447e">32.5.4. Query-Related Issues</a>
<ul>
<li><a href="#orgf04202a">32.5.4.1. Case Sensitivity in String Searches</a></li>
<li><a href="#org9adc23c">32.5.4.2. Problems Using DATE Columns</a></li>
<li><a href="#org3ebf132">32.5.4.3. Problems with NULL Values</a></li>
<li><a href="#org92ff0b9">32.5.4.4. Problems with Column Aliases</a></li>
<li><a href="#org3656b01">32.5.4.5. Rollback Failure for Nontransactional Tables</a></li>
<li><a href="#org3e0f490">32.5.4.6. Deleting Rows from Related Tables</a></li>
<li><a href="#org159f49b">32.5.4.7. Solving Problems with No Matching Rows</a></li>
<li><a href="#orgabf0d31">32.5.4.8. Problems with Floating-Point Values</a></li>
</ul>
</li>
<li><a href="#org46cfb12">32.5.5. Optimizer-Related Issues</a></li>
<li><a href="#org54fb27e">32.5.6. Table Definition-Related Issues</a></li>
<li><a href="#orgfc5cd52">32.5.7. Known Issues in MySQL</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9f77c08">33. Restrictions and Limits</a></li>
<li><a href="#org91fd557">34. MySQL Glossary</a></li>
<li><a href="#orgf167161">35. General Index</a></li>
<li><a href="#org20b78c0">36. Function Index</a></li>
<li><a href="#orgc0162e0">37. Command Index</a></li>
<li><a href="#orgd83f518">38. Function Index</a></li>
<li><a href="#org839a7f9">39. INFORMATION_SCHEMA Index</a></li>
<li><a href="#org9c97bba">40. Join Types Index</a></li>
<li><a href="#orgb049a21">41. Operator Index</a></li>
<li><a href="#orga347ff6">42. Option Index</a></li>
<li><a href="#org1f4eac0">43. Privileges Index</a></li>
<li><a href="#org8a27aa2">44. Modes Index</a></li>
<li><a href="#org1e91472">45. Statement/Syntax Index</a></li>
<li><a href="#orgdb9a113">46. Status Variable Index</a></li>
<li><a href="#orgb5d6bd3">47. System Variable Index</a></li>
<li><a href="#orge0ce76f">48. Transaction Isolation Level Index</a></li>
</ul>
</div>
</div>
<p>
#+email：phenix3443@gmail.com
</p>

<div id="outline-container-org2d76d0c" class="outline-2">
<h2 id="org2d76d0c"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
基于<a href="https://dev.mysql.com/doc/refman/5.7/en/">MySQL 5.7 Reference Manual</a>以及日常使用整理的最佳实践。排列按照手册章节进行排列。
</p>
</div>
</div>

<div id="outline-container-org14d0e18" class="outline-2">
<h2 id="org14d0e18"><span class="section-number-2">2</span> Preface and Legal Notices</h2>
</div>
<div id="outline-container-orgbf83808" class="outline-2">
<h2 id="orgbf83808"><span class="section-number-2">3</span> General Information</h2>
</div>
<div id="outline-container-org831dd58" class="outline-2">
<h2 id="org831dd58"><span class="section-number-2">4</span> Installing and Upgrading MySQL</h2>
</div>
<div id="outline-container-org4c80e07" class="outline-2">
<h2 id="org4c80e07"><span class="section-number-2">5</span> Using MySQL as a Document Store</h2>
</div>
<div id="outline-container-orgb848aa9" class="outline-2">
<h2 id="orgb848aa9"><span class="section-number-2">6</span> Tutorial</h2>
</div>
<div id="outline-container-orgf6b088f" class="outline-2">
<h2 id="orgf6b088f"><span class="section-number-2">7</span> MySQL Programs</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgd11641e" class="outline-3">
<h3 id="orgd11641e"><span class="section-number-3">7.1</span> Overview of MySQL Programs</h3>
</div>
<div id="outline-container-orgacc67fa" class="outline-3">
<h3 id="orgacc67fa"><span class="section-number-3">7.2</span> Using MySQL Programs</h3>
<div class="outline-text-3" id="text-7-2">
</div>
<div id="outline-container-org76790ee" class="outline-4">
<h4 id="org76790ee"><span class="section-number-4">7.2.1</span> Invoking MySQL Programs</h4>
</div>
<div id="outline-container-org160e83e" class="outline-4">
<h4 id="org160e83e"><span class="section-number-4">7.2.2</span> Connecting to the MySQL Server</h4>
</div>
<div id="outline-container-org1df0b05" class="outline-4">
<h4 id="org1df0b05"><span class="section-number-4">7.2.3</span> Specifying Program Options</h4>
</div>
<div id="outline-container-orgc0e9b63" class="outline-4">
<h4 id="orgc0e9b63"><span class="section-number-4">7.2.4</span> Using Options on the Command Line</h4>
</div>
<div id="outline-container-orgafdb448" class="outline-4">
<h4 id="orgafdb448"><span class="section-number-4">7.2.5</span> Program Option Modifiers</h4>
</div>
<div id="outline-container-org17a748b" class="outline-4">
<h4 id="org17a748b"><span class="section-number-4">7.2.6</span> Using Option Files</h4>
</div>
<div id="outline-container-org4e3818b" class="outline-4">
<h4 id="org4e3818b"><span class="section-number-4">7.2.7</span> Command-Line Options that Affect Option-File Handling</h4>
</div>
<div id="outline-container-orge7bf750" class="outline-4">
<h4 id="orge7bf750"><span class="section-number-4">7.2.8</span> Using Options to Set Program Variables</h4>
</div>
<div id="outline-container-orgb60cae4" class="outline-4">
<h4 id="orgb60cae4"><span class="section-number-4">7.2.9</span> Option Defaults, Options Expecting Values, and the = Sign</h4>
</div>
<div id="outline-container-org25cc85e" class="outline-4">
<h4 id="org25cc85e"><span class="section-number-4">7.2.10</span> Setting Environment Variables</h4>
</div>
</div>
<div id="outline-container-org5507cfb" class="outline-3">
<h3 id="org5507cfb"><span class="section-number-3">7.3</span> MySQL Server and Server-Startup Programs</h3>
</div>
<div id="outline-container-org3633dd6" class="outline-3">
<h3 id="org3633dd6"><span class="section-number-3">7.4</span> MySQL Installation-Related Programs</h3>
</div>
<div id="outline-container-org9b03127" class="outline-3">
<h3 id="org9b03127"><span class="section-number-3">7.5</span> MySQL Client Programs</h3>
<div class="outline-text-3" id="text-7-5">
</div>
<div id="outline-container-org79e125c" class="outline-4">
<h4 id="org79e125c"><span class="section-number-4">7.5.1</span> mysql — The MySQL Command-Line Tool</h4>
<div class="outline-text-4" id="text-7-5-1">
</div>
<div id="outline-container-org20b7323" class="outline-5">
<h5 id="org20b7323"><span class="section-number-5">7.5.1.1</span> mysql Options</h5>
</div>
<div id="outline-container-org829123d" class="outline-5">
<h5 id="org829123d"><span class="section-number-5">7.5.1.2</span> mysql Commands</h5>
</div>
<div id="outline-container-org02533d8" class="outline-5">
<h5 id="org02533d8"><span class="section-number-5">7.5.1.3</span> mysql Logging</h5>
</div>
<div id="outline-container-org87397ca" class="outline-5">
<h5 id="org87397ca"><span class="section-number-5">7.5.1.4</span> mysql Server-Side Help</h5>
</div>
<div id="outline-container-orgdb71c1e" class="outline-5">
<h5 id="orgdb71c1e"><span class="section-number-5">7.5.1.5</span> Executing SQL Statements from a Text File</h5>
</div>
<div id="outline-container-orga1c48b8" class="outline-5">
<h5 id="orga1c48b8"><span class="section-number-5">7.5.1.6</span> mysql Tips</h5>
</div>
</div>
<div id="outline-container-org5ec5946" class="outline-4">
<h4 id="org5ec5946"><span class="section-number-4">7.5.2</span> mysqladmin — Client for Administering a MySQL Server</h4>
</div>
<div id="outline-container-org0a657ca" class="outline-4">
<h4 id="org0a657ca"><span class="section-number-4">7.5.3</span> mysqlcheck — A Table Maintenance Program</h4>
</div>
<div id="outline-container-org65ad3f4" class="outline-4">
<h4 id="org65ad3f4"><span class="section-number-4">7.5.4</span> mysqldump — A Database Backup Program</h4>
</div>
