docs/mysql/mysql-manual.html
<div id="outline-container-orgef82c5e" class="outline-4">
<h4 id="orgef82c5e"><span class="section-number-4">7.5.5</span> mysqlimport — A Data Import Program</h4>
</div>
<div id="outline-container-org3280b2e" class="outline-4">
<h4 id="org3280b2e"><span class="section-number-4">7.5.6</span> mysqlpump — A Database Backup Program</h4>
</div>
<div id="outline-container-orgbd1ca63" class="outline-4">
<h4 id="orgbd1ca63"><span class="section-number-4">7.5.7</span> mysqlshow — Display Database, Table, and Column Information</h4>
</div>
<div id="outline-container-orga485fad" class="outline-4">
<h4 id="orga485fad"><span class="section-number-4">7.5.8</span> mysqlslap — Load Emulation Client</h4>
</div>
</div>
<div id="outline-container-org868bff2" class="outline-3">
<h3 id="org868bff2"><span class="section-number-3">7.6</span> MySQL Administrative and Utility Programs</h3>
</div>
<div id="outline-container-org80206a9" class="outline-3">
<h3 id="org80206a9"><span class="section-number-3">7.7</span> MySQL Program Development Utilities</h3>
</div>
<div id="outline-container-org9f7b51e" class="outline-3">
<h3 id="org9f7b51e"><span class="section-number-3">7.8</span> Miscellaneous Programs</h3>
</div>
</div>
<div id="outline-container-org996c546" class="outline-2">
<h2 id="org996c546"><span class="section-number-2">8</span> MySQL Server Administration</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org580d1cb" class="outline-3">
<h3 id="org580d1cb"><span class="section-number-3">8.1</span> The MySQL Server</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org9eff953" class="outline-4">
<h4 id="org9eff953"><span class="section-number-4">8.1.1</span> Server Option and Variable Reference</h4>
</div>
<div id="outline-container-org8c95282" class="outline-4">
<h4 id="org8c95282"><span class="section-number-4">8.1.2</span> Server Configuration Defaults</h4>
</div>
<div id="outline-container-org815d627" class="outline-4">
<h4 id="org815d627"><span class="section-number-4">8.1.3</span> Server Command Options</h4>
</div>
<div id="outline-container-orgf000c7f" class="outline-4">
<h4 id="orgf000c7f"><span class="section-number-4">8.1.4</span> Server System Variables</h4>
</div>
<div id="outline-container-orgfe701a0" class="outline-4">
<h4 id="orgfe701a0"><span class="section-number-4">8.1.5</span> Using System Variables</h4>
</div>
<div id="outline-container-orgd552cfe" class="outline-4">
<h4 id="orgd552cfe"><span class="section-number-4">8.1.6</span> Server Status Variables</h4>
</div>
<div id="outline-container-org796178d" class="outline-4">
<h4 id="org796178d"><span class="section-number-4">8.1.7</span> Server SQL Modes</h4>
</div>
<div id="outline-container-orgf9dec9a" class="outline-4">
<h4 id="orgf9dec9a"><span class="section-number-4">8.1.8</span> Server Plugins</h4>
</div>
<div id="outline-container-org2f3255b" class="outline-4">
<h4 id="org2f3255b"><span class="section-number-4">8.1.9</span> IPv6 Support</h4>
</div>
<div id="outline-container-org1aa2721" class="outline-4">
<h4 id="org1aa2721"><span class="section-number-4">8.1.10</span> Server-Side Help</h4>
</div>
<div id="outline-container-org20cd4dd" class="outline-4">
<h4 id="org20cd4dd"><span class="section-number-4">8.1.11</span> Server Response to Signals</h4>
</div>
<div id="outline-container-org6c5a7d7" class="outline-4">
<h4 id="org6c5a7d7"><span class="section-number-4">8.1.12</span> The Server Shutdown Process</h4>
</div>
</div>
<div id="outline-container-orgacdc419" class="outline-3">
<h3 id="orgacdc419"><span class="section-number-3">8.2</span> The MySQL Data Directory</h3>
</div>
<div id="outline-container-org76d9956" class="outline-3">
<h3 id="org76d9956"><span class="section-number-3">8.3</span> The mysql System Database</h3>
</div>
<div id="outline-container-orgaeba899" class="outline-3">
<h3 id="orgaeba899"><span class="section-number-3">8.4</span> MySQL Server Logs</h3>
</div>
<div id="outline-container-org18f411f" class="outline-3">
<h3 id="org18f411f"><span class="section-number-3">8.5</span> Running Multiple MySQL Instances on One Machine</h3>
</div>
<div id="outline-container-org02e7614" class="outline-3">
<h3 id="org02e7614"><span class="section-number-3">8.6</span> Tracing mysqld Using DTrace</h3>
</div>
</div>
<div id="outline-container-orgfcc0411" class="outline-2">
<h2 id="orgfcc0411"><span class="section-number-2">9</span> Security</h2>
</div>
<div id="outline-container-orgb9c389c" class="outline-2">
<h2 id="orgb9c389c"><span class="section-number-2">10</span> Backup and Recovery</h2>
</div>
<div id="outline-container-orgf2931e8" class="outline-2">
<h2 id="orgf2931e8"><span class="section-number-2">11</span> Optimization</h2>
</div>
<div id="outline-container-org43e2ba5" class="outline-2">
<h2 id="org43e2ba5"><span class="section-number-2">12</span> Language Structure</h2>
</div>
<div id="outline-container-org798c840" class="outline-2">
<h2 id="org798c840"><span class="section-number-2">13</span> Globalization</h2>
</div>
<div id="outline-container-org5b785f2" class="outline-2">
<h2 id="org5b785f2"><span class="section-number-2">14</span> Data Types</h2>
</div>
<div id="outline-container-org140883f" class="outline-2">
<h2 id="org140883f"><span class="section-number-2">15</span> Functions and Operators</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-org6341f25" class="outline-3">
<h3 id="org6341f25"><span class="section-number-3">15.1</span> 13.5 String Functions</h3>
<div class="outline-text-3" id="text-15-1">
</div>
<div id="outline-container-org5c18731" class="outline-4">
<h4 id="org5c18731"><span class="section-number-4">15.1.1</span> 13.5.2 Regular Expressions</h4>
</div>
</div>
</div>

<div id="outline-container-orgb787f03" class="outline-2">
<h2 id="orgb787f03"><span class="section-number-2">16</span> SQL Statement Syntax</h2>
</div>
<div id="outline-container-orgeae09a3" class="outline-2">
<h2 id="orgeae09a3"><span class="section-number-2">17</span> The InnoDB Storage Engine</h2>
</div>
<div id="outline-container-org035296d" class="outline-2">
<h2 id="org035296d"><span class="section-number-2">18</span> Alternative Storage Engines</h2>
</div>
<div id="outline-container-org87208fc" class="outline-2">
<h2 id="org87208fc"><span class="section-number-2">19</span> High Availability and Scalability</h2>
</div>
<div id="outline-container-orgc980611" class="outline-2">
<h2 id="orgc980611"><span class="section-number-2">20</span> Replication</h2>
</div>
<div id="outline-container-orgf0d6084" class="outline-2">
<h2 id="orgf0d6084"><span class="section-number-2">21</span> MySQL Cluster NDB 7.5</h2>
</div>
<div id="outline-container-orgdd371a7" class="outline-2">
<h2 id="orgdd371a7"><span class="section-number-2">22</span> Partitioning</h2>
</div>
<div id="outline-container-orgb2cbd0a" class="outline-2">
<h2 id="orgb2cbd0a"><span class="section-number-2">23</span> Stored Programs and Views</h2>
</div>
<div id="outline-container-org9a0143a" class="outline-2">
<h2 id="org9a0143a"><span class="section-number-2">24</span> INFORMATION_SCHEMA Tables</h2>
</div>
<div id="outline-container-orgedb14d2" class="outline-2">
<h2 id="orgedb14d2"><span class="section-number-2">25</span> MySQL Performance Schema</h2>
</div>
<div id="outline-container-org63d3e1c" class="outline-2">
<h2 id="org63d3e1c"><span class="section-number-2">26</span> MySQL sys Schema</h2>
</div>
<div id="outline-container-org6e5422a" class="outline-2">
<h2 id="org6e5422a"><span class="section-number-2">27</span> Connectors and APIs</h2>
</div>
<div id="outline-container-org63fbd71" class="outline-2">
<h2 id="org63fbd71"><span class="section-number-2">28</span> Extending MySQL</h2>
</div>
<div id="outline-container-org302b43d" class="outline-2">
<h2 id="org302b43d"><span class="section-number-2">29</span> MySQL Enterprise Edition</h2>
</div>
<div id="outline-container-orgba3e75d" class="outline-2">
<h2 id="orgba3e75d"><span class="section-number-2">30</span> MySQL Workbench</h2>
</div>
<div id="outline-container-org04dd98d" class="outline-2">
<h2 id="org04dd98d"><span class="section-number-2">31</span> MySQL 5.7 Frequently Asked Questions</h2>
</div>
<div id="outline-container-org9108c08" class="outline-2">
<h2 id="org9108c08"><span class="section-number-2">32</span> Errors, Error Codes, and Common Problems</h2>
<div class="outline-text-2" id="text-32">
</div>
<div id="outline-container-orgd4268db" class="outline-3">
<h3 id="orgd4268db"><span class="section-number-3">32.1</span> Sources of Error Information</h3>
</div>
<div id="outline-container-org8b4f80c" class="outline-3">
<h3 id="org8b4f80c"><span class="section-number-3">32.2</span> Types of Error Values</h3>
</div>
<div id="outline-container-org7e41f6f" class="outline-3">
<h3 id="org7e41f6f"><span class="section-number-3">32.3</span> Server Error Codes and Messages</h3>
</div>
<div id="outline-container-orgda92d98" class="outline-3">
<h3 id="orgda92d98"><span class="section-number-3">32.4</span> Client Error Codes and Messages</h3>
</div>
<div id="outline-container-org53ccf4b" class="outline-3">
<h3 id="org53ccf4b"><span class="section-number-3">32.5</span> Problems and Common Errors</h3>
<div class="outline-text-3" id="text-32-5">
</div>
<div id="outline-container-org81ef973" class="outline-4">
<h4 id="org81ef973"><span class="section-number-4">32.5.1</span> How to Determine What Is Causing a Problem</h4>
</div>
<div id="outline-container-org0eaccc3" class="outline-4">
<h4 id="org0eaccc3"><span class="section-number-4">32.5.2</span> Common Errors When Using MySQL Programs</h4>
</div>
<div id="outline-container-orgc435381" class="outline-4">
<h4 id="orgc435381"><span class="section-number-4">32.5.3</span> Administration-Related Issues</h4>
</div>
<div id="outline-container-org4eb447e" class="outline-4">
<h4 id="org4eb447e"><span class="section-number-4">32.5.4</span> Query-Related Issues</h4>
<div class="outline-text-4" id="text-32-5-4">
</div>
<div id="outline-container-orgf04202a" class="outline-5">
<h5 id="orgf04202a"><span class="section-number-5">32.5.4.1</span> Case Sensitivity in String Searches</h5>
</div>
<div id="outline-container-org9adc23c" class="outline-5">
<h5 id="org9adc23c"><span class="section-number-5">32.5.4.2</span> Problems Using DATE Columns</h5>
</div>
<div id="outline-container-org3ebf132" class="outline-5">
<h5 id="org3ebf132"><span class="section-number-5">32.5.4.3</span> Problems with NULL Values</h5>
</div>
<div id="outline-container-org92ff0b9" class="outline-5">
<h5 id="org92ff0b9"><span class="section-number-5">32.5.4.4</span> Problems with Column Aliases</h5>
</div>
<div id="outline-container-org3656b01" class="outline-5">
<h5 id="org3656b01"><span class="section-number-5">32.5.4.5</span> Rollback Failure for Nontransactional Tables</h5>
</div>
<div id="outline-container-org3e0f490" class="outline-5">
<h5 id="org3e0f490"><span class="section-number-5">32.5.4.6</span> Deleting Rows from Related Tables</h5>
</div>
<div id="outline-container-org159f49b" class="outline-5">
<h5 id="org159f49b"><span class="section-number-5">32.5.4.7</span> Solving Problems with No Matching Rows</h5>
</div>
<div id="outline-container-orgabf0d31" class="outline-5">
<h5 id="orgabf0d31"><span class="section-number-5">32.5.4.8</span> Problems with Floating-Point Values</h5>
</div>
</div>
<div id="outline-container-org46cfb12" class="outline-4">
<h4 id="org46cfb12"><span class="section-number-4">32.5.5</span> Optimizer-Related Issues</h4>
</div>
<div id="outline-container-org54fb27e" class="outline-4">
<h4 id="org54fb27e"><span class="section-number-4">32.5.6</span> Table Definition-Related Issues</h4>
</div>
<div id="outline-container-orgfc5cd52" class="outline-4">
<h4 id="orgfc5cd52"><span class="section-number-4">32.5.7</span> Known Issues in MySQL</h4>
</div>
</div>
</div>
<div id="outline-container-org9f77c08" class="outline-2">
<h2 id="org9f77c08"><span class="section-number-2">33</span> Restrictions and Limits</h2>
</div>
<div id="outline-container-org91fd557" class="outline-2">
<h2 id="org91fd557"><span class="section-number-2">34</span> MySQL Glossary</h2>
</div>
<div id="outline-container-orgf167161" class="outline-2">
<h2 id="orgf167161"><span class="section-number-2">35</span> General Index</h2>
</div>
<div id="outline-container-org20b78c0" class="outline-2">
<h2 id="org20b78c0"><span class="section-number-2">36</span> Function Index</h2>
</div>
<div id="outline-container-orgc0162e0" class="outline-2">
<h2 id="orgc0162e0"><span class="section-number-2">37</span> Command Index</h2>
</div>
<div id="outline-container-orgd83f518" class="outline-2">
<h2 id="orgd83f518"><span class="section-number-2">38</span> Function Index</h2>
</div>
<div id="outline-container-org839a7f9" class="outline-2">
<h2 id="org839a7f9"><span class="section-number-2">39</span> INFORMATION_SCHEMA Index</h2>
</div>
<div id="outline-container-org9c97bba" class="outline-2">
<h2 id="org9c97bba"><span class="section-number-2">40</span> Join Types Index</h2>
</div>
<div id="outline-container-orgb049a21" class="outline-2">
<h2 id="orgb049a21"><span class="section-number-2">41</span> Operator Index</h2>
</div>
<div id="outline-container-orga347ff6" class="outline-2">
<h2 id="orga347ff6"><span class="section-number-2">42</span> Option Index</h2>
</div>
<div id="outline-container-org1f4eac0" class="outline-2">
<h2 id="org1f4eac0"><span class="section-number-2">43</span> Privileges Index</h2>
</div>
